# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv',delimiter = ',')

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [36]:
baby_names = baby_names[['Name','Gender','State','Count']]
baby_names.head(10)

       Name Gender State  Count
0      Emma      F    AK     62
1   Madison      F    AK     48
2    Hannah      F    AK     46
3     Grace      F    AK     44
4     Emily      F    AK     41
5   Abigail      F    AK     37
6    Olivia      F    AK     33
7  Isabella      F    AK     30
8    Alyssa      F    AK     29
9    Sophia      F    AK     28

### Step 6. Is there more male or female names in the dataset?

In [15]:
males = baby_names['Gender'].value_counts()['M']
females = baby_names['Gender'].value_counts()['F']

457549
558846

### Step 7. Group the dataset by name and assign to names

In [39]:
names = baby_names.groupby('Name').sum()

/var/folders/c8/vb33lm95521ccl9r7zjb1hvc0000gp/T/ipykernel_19769/379571613.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  names = baby_names.groupby('Name').sum()

### Step 8. How many different names exist in the dataset?

In [24]:
frequency = names.Name.nunique()
print(frequency)

Name
Aaban      1
Aadan      1
Aadarsh    1
Aaden      1
Aadhav     1
          ..
Zyra       1
Zyrah      1
Zyren      1
Zyria      1
Zyriah     1
Name: Name, Length: 17632, dtype: int64

### Step 9. What is the name with most occurrences?

AttributeError: 'DataFrameGroupBy' object has no attribute 'Mode'

### Step 10. How many different names have the least occurrences?

In [40]:
len(names[names.Count == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [43]:
names.Count.median()

49.0

### Step 12. What is the standard deviation of names?

In [44]:
names.std()

Count    11006.069468
dtype: float64

### Step 13. Get a summary with the mean, min, max, std and quartiles.